{"config": [{"config": {"name": "conv2d_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "dtype": "float32", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "trainable": true, "batch_input_shape": [null, 50, 100, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}